In [44]:
#  Import libraries

import pandas as pd
import numpy as np

In [45]:
s = pd.Series([3,4,2,np.nan,6,2,5,6,2])
s

0    3.0
1    4.0
2    2.0
3    NaN
4    6.0
5    2.0
6    5.0
7    6.0
8    2.0
dtype: float64

In [46]:
dates = pd.date_range('20001001',periods=12)
dates

DatetimeIndex(['2000-10-01', '2000-10-02', '2000-10-03', '2000-10-04',
               '2000-10-05', '2000-10-06', '2000-10-07', '2000-10-08',
               '2000-10-09', '2000-10-10', '2000-10-11', '2000-10-12'],
              dtype='datetime64[ns]', freq='D')

In [47]:
df =pd.DataFrame(np.random.randn(12,3),index=dates, columns=list('ABC'))
df

                   A         B         C
2000-10-01  0.110738 -1.245779  0.510148
2000-10-02  0.395699  1.440926 -0.280575
2000-10-03 -1.343115 -1.977230  0.801594
2000-10-04 -2.060902  1.295034  0.318044
2000-10-05  1.759401  0.009491  0.448379
2000-10-06  2.043332  0.064519 -2.139280
2000-10-07 -0.706661  0.338263  0.643181
2000-10-08  1.679691  0.420446  0.679731
2000-10-09 -0.681835 -0.576232 -1.587717
2000-10-10  2.373689  2.764466  0.456080
2000-10-11 -0.444223 -1.184355 -0.855885
2000-10-12 -0.060229 -0.979817 -0.269323

In [48]:
d2 = pd.DataFrame(
{
  'A':'1.0',
  'B':pd.Timestamp(20220209),
  'D':pd.Series(1,index=list(range(4)),dtype="float32"),
  'C':np.array([3]*4,dtype="int32"),
  'E':pd.Categorical(["someone_1","someone_2","someone_3","someone_4",]),
  'F':"fool"
 }
)
d2

     A                             B    D  C          E     F
0  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_1  fool
1  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_2  fool
2  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_3  fool
3  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_4  fool

In [49]:
print(d2.dtypes)

A            object
B    datetime64[ns]
D           float32
C             int32
E          category
F            object
dtype: object

In [27]:
d2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [28]:
 d2.describe()

         D    C
count  4.0  4.0
mean   1.0  3.0
std    0.0  0.0
min    1.0  3.0
25%    1.0  3.0
50%    1.0  3.0
75%    1.0  3.0
max    1.0  3.0

In [29]:
d2[0:]

     A                             B    D  C          E     F
0  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_1  fool
1  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_2  fool
2  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_3  fool
3  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_4  fool

In [30]:
d2[0:2]

     A                             B    D  C          E     F
0  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_1  fool
1  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_2  fool

In [31]:
d2.loc[:,["C","D"]]

   C    D
0  3  1.0
1  3  1.0
2  3  1.0
3  3  1.0

In [32]:
d2.loc['20220101':"20220104",["A","C"]]

Empty DataFrame
Columns: [A, C]
Index: []

In [33]:
d2.iloc[0:2,:]

     A                             B    D  C          E     F
0  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_1  fool
1  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_2  fool

In [34]:
d2.iloc[1:2,:3]

     A                             B    D
1  1.0 1970-01-01 00:00:00.020220209  1.0

In [35]:
df[df['C'] > 1]

                   A         B         C
2000-10-05 -1.416098  0.793983  1.045163
2000-10-10 -0.297103 -0.509514  1.479842

# Data Analysis of Titanoc dataset

In [36]:
#importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [37]:
k = sns.load_dataset('titanic')
k.head(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False

In [38]:
k.to_csv('titanic.csv')

In [39]:
k.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [40]:
k.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [41]:
#  Dropping Few column for new dataset
k.drop(["deck","alone"],axis=1).head(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes

In [42]:
k.mean()

C:\Users\NK107\AppData\Local\Temp/ipykernel_8144/3283639663.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  k.mean()

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [53]:
k.value_counts(["survived"])

survived
0           549
1           342
dtype: int64

In [55]:

# adult related analysis

k.groupby(["sex","class"]).mean()

               survived  pclass        age     sibsp     parch        fare  \
sex    class
female First   0.968085     1.0  34.611765  0.553191  0.457447  106.125798
       Second  0.921053     2.0  28.722973  0.486842  0.605263   21.970121
       Third   0.500000     3.0  21.750000  0.895833  0.798611   16.118810
male   First   0.368852     1.0  41.281386  0.311475  0.278689   67.226127
       Second  0.157407     2.0  30.740707  0.342593  0.222222   19.741782
       Third   0.135447     3.0  26.507589  0.498559  0.224784   12.661633

               adult_male     alone
sex    class
female First     0.000000  0.361702
       Second    0.000000  0.421053
       Third     0.000000  0.416667
male   First     0.975410  0.614754
       Second    0.916667  0.666667
       Third     0.919308  0.760807

In [58]:
k[k["age"] <  18].mean()

C:\Users\NK107\AppData\Local\Temp/ipykernel_8144/1331876749.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  k[k["age"] <  18].mean()

survived       0.539823
pclass         2.584071
age            9.041327
sibsp          1.460177
parch          1.053097
fare          31.220798
adult_male     0.159292
alone          0.203540
dtype: float64

In [60]:
# Childrens related analysis

k[k["age"] <  18].groupby(["sex","class"]).mean()

               survived  pclass        age     sibsp     parch        fare  \
sex    class
female First   0.875000     1.0  14.125000  0.500000  0.875000  104.083337
       Second  1.000000     2.0   8.333333  0.583333  1.083333   26.241667
       Third   0.542857     3.0   8.428571  1.571429  1.057143   18.727977
male   First   1.000000     1.0   8.230000  0.500000  2.000000  116.072900
       Second  0.818182     2.0   4.757273  0.727273  1.000000   25.659473
       Third   0.232558     3.0   9.963256  2.069767  1.000000   22.752523

               adult_male     alone
sex    class
female First     0.000000  0.125000
       Second    0.000000  0.166667
       Third     0.000000  0.228571
male   First     0.250000  0.000000
       Second    0.181818  0.181818
       Third     0.348837  0.232558